
rule Worm_Win32_Texbot_A{
	meta:
		description = "Worm:Win32/Texbot.A,SIGNATURE_TYPE_PEHSTR,03 00 03 00 03 00 00 01 00 "
		
	strings :
		$a_01_0 = {00 00 73 00 74 00 61 00 72 00 74 00 6d 00 73 00 67 00 73 00 70 00 72 00 65 00 61 00 64 00 00 00 } //01 00 
		$a_01_1 = {00 00 2a 00 66 00 61 00 63 00 65 00 62 00 6f 00 6f 00 6b 00 2e 00 63 00 6f 00 6d 00 2a 00 00 00 } //01 00 
		$a_01_2 = {00 6d 6f 64 52 75 6e 41 70 70 4d 65 6d 00 } //00 00  洀摯畒䅮灰敍m
		$a_01_3 = {00 80 } //10 00 
	condition:
		any of ($a_*)
 
}