
rule Trojan_BAT_AgentTesla_ASEE_MTB{
	meta:
		description = "Trojan:BAT/AgentTesla.ASEE!MTB,SIGNATURE_TYPE_PEHSTR_EXT,04 00 04 00 03 00 00 "
		
	strings :
		$a_03_0 = {26 20 88 13 00 00 28 90 01 01 00 00 0a 73 90 01 01 00 00 0a 0d 09 16 6f 90 00 } //2
		$a_01_1 = {43 04 41 04 42 04 30 04 3d 04 3e 04 32 04 3b 04 35 04 3d 04 38 04 4f 04 20 00 3a 04 40 04 35 04 34 04 38 04 42 04 3d 04 4b 04 3c 04 38 04 20 00 3e 04 40 04 33 04 30 04 3d 04 38 04 37 04 30 04 46 04 38 04 4f 04 3c 04 38 04 } //1 установления кредитными организациями
		$a_01_2 = {3f 04 3e 04 42 04 40 04 35 04 31 04 38 04 42 04 35 04 3b 04 4f 04 20 00 37 04 30 04 20 00 41 04 3e 04 32 04 35 04 40 04 48 04 35 04 3d 04 38 04 35 04 20 00 3e 04 3f 04 35 04 40 04 30 04 46 04 38 04 39 04 20 00 3f 04 3e 04 20 00 34 04 3e 04 33 04 3e 04 32 04 3e 04 40 04 43 04 } //1 потребителя за совершение операций по договору
	condition:
		((#a_03_0  & 1)*2+(#a_01_1  & 1)*1+(#a_01_2  & 1)*1) >=4
 
}