
rule Trojan_BAT_AgentTesla_EDD_MTB{
	meta:
		description = "Trojan:BAT/AgentTesla.EDD!MTB,SIGNATURE_TYPE_PEHSTR_EXT,0d 00 0d 00 05 00 00 "
		
	strings :
		$a_03_0 = {08 09 07 09 18 5a 18 6f ?? ?? ?? 0a 1f 10 28 ?? ?? ?? 0a 9c 00 09 17 58 0d 09 08 8e 69 fe 04 13 04 11 04 2d da } //10
		$a_03_1 = {07 08 06 08 18 5a 18 6f ?? ?? ?? 0a 1f 10 28 ?? ?? ?? 0a 9c 00 08 17 58 0c 08 07 8e 69 fe 04 0d 09 2d dc } //10
		$a_01_2 = {00 44 69 73 70 6c 61 79 4e 61 6d 65 00 } //1
		$a_01_3 = {00 43 72 65 61 74 65 49 6e 73 74 61 6e 63 65 00 } //1 䌀敲瑡䥥獮慴据e
		$a_01_4 = {00 53 75 62 73 74 72 69 6e 67 00 } //1
	condition:
		((#a_03_0  & 1)*10+(#a_03_1  & 1)*10+(#a_01_2  & 1)*1+(#a_01_3  & 1)*1+(#a_01_4  & 1)*1) >=13
 
}