
rule Trojan_BAT_AgentTesla_EOF_MTB{
	meta:
		description = "Trojan:BAT/AgentTesla.EOF!MTB,SIGNATURE_TYPE_PEHSTR_EXT,08 00 08 00 08 00 00 01 00 "
		
	strings :
		$a_01_0 = {24 35 33 62 36 61 38 63 34 2d 62 32 65 34 2d 34 38 66 64 2d 39 39 37 35 2d 63 39 37 62 66 61 38 30 39 33 65 34 } //01 00  $53b6a8c4-b2e4-48fd-9975-c97bfa8093e4
		$a_01_1 = {00 54 6f 55 49 6e 74 33 32 00 } //01 00  吀啯湉㍴2
		$a_01_2 = {00 53 75 62 73 74 72 69 6e 67 00 } //01 00 
		$a_01_3 = {00 47 65 74 4d 65 74 68 6f 64 73 00 } //01 00  䜀瑥敍桴摯s
		$a_01_4 = {00 47 65 74 50 69 78 65 6c 00 } //01 00  䜀瑥楐數l
		$a_01_5 = {00 54 6f 41 72 67 62 00 } //01 00  吀䅯杲b
		$a_01_6 = {00 54 6f 49 6e 74 33 32 00 } //01 00 
		$a_01_7 = {00 47 65 74 54 79 70 65 73 00 } //00 00  䜀瑥祔数s
	condition:
		any of ($a_*)
 
}