
rule Trojan_BAT_AgentTesla_ERD_MTB{
	meta:
		description = "Trojan:BAT/AgentTesla.ERD!MTB,SIGNATURE_TYPE_PEHSTR_EXT,07 00 07 00 07 00 00 01 00 "
		
	strings :
		$a_01_0 = {24 45 44 42 46 44 45 35 31 2d 43 37 36 46 2d 34 45 36 31 2d 41 39 31 43 2d 33 31 34 43 46 30 42 34 39 45 35 41 } //01 00  $EDBFDE51-C76F-4E61-A91C-314CF0B49E5A
		$a_01_1 = {53 00 75 00 62 00 73 00 74 00 72 00 69 00 6e 00 67 00 } //01 00  Substring
		$a_01_2 = {00 47 65 74 4d 65 74 68 6f 64 73 00 } //01 00  䜀瑥敍桴摯s
		$a_01_3 = {00 47 65 74 50 69 78 65 6c 00 } //01 00  䜀瑥楐數l
		$a_01_4 = {00 54 6f 41 72 67 62 00 } //01 00  吀䅯杲b
		$a_01_5 = {00 54 6f 49 6e 74 33 32 00 } //01 00 
		$a_01_6 = {00 47 65 74 54 79 70 65 73 00 } //00 00  䜀瑥祔数s
	condition:
		any of ($a_*)
 
}