
rule Trojan_BAT_AgentTesla_ETX_MTB{
	meta:
		description = "Trojan:BAT/AgentTesla.ETX!MTB,SIGNATURE_TYPE_PEHSTR_EXT,06 00 06 00 06 00 00 01 00 "
		
	strings :
		$a_01_0 = {24 32 62 38 65 65 32 66 34 2d 34 62 36 31 2d 34 61 31 63 2d 61 37 65 34 2d 31 32 38 36 61 61 31 65 31 64 32 37 } //01 00  $2b8ee2f4-4b61-4a1c-a7e4-1286aa1e1d27
		$a_01_1 = {00 47 65 74 4d 65 74 68 6f 64 00 } //01 00 
		$a_01_2 = {00 43 72 79 70 74 6f 53 74 72 65 61 6d 00 } //01 00  䌀祲瑰卯牴慥m
		$a_01_3 = {00 47 65 74 54 79 70 65 00 } //01 00 
		$a_01_4 = {00 43 72 65 61 74 65 44 65 63 72 79 70 74 6f 72 00 } //01 00 
		$a_01_5 = {00 54 6f 49 6e 74 33 32 00 } //00 00 
	condition:
		any of ($a_*)
 
}