
rule TrojanDownloader_Win32_Ligzoc_B{
	meta:
		description = "TrojanDownloader:Win32/Ligzoc.B,SIGNATURE_TYPE_PEHSTR_EXT,05 00 04 00 07 00 00 01 00 "
		
	strings :
		$a_01_0 = {25 32 36 74 79 70 65 25 33 44 30 25 32 36 6f 6e 65 25 33 44 31 25 32 36 74 77 6f 25 33 44 31 25 32 36 77 62 25 33 44 00 } //01 00  ㈥琶灹╥䐳┰㘲湯╥䐳┱㘲睴╯䐳┱㘲扷㌥D
		$a_01_1 = {26 74 79 70 65 3d 30 26 6f 6e 65 3d 31 26 74 77 6f 3d 31 26 77 62 3d 00 } //01 00  琦灹㵥☰湯㵥☱睴㵯☱扷=
		$a_01_2 = {25 32 36 70 63 6e 61 6d 65 25 33 44 00 } //01 00 
		$a_01_3 = {26 70 63 6e 61 6d 65 3d 00 } //01 00 
		$a_01_4 = {54 6f 6e 67 6a 69 00 } //01 00 
		$a_01_5 = {4f 72 61 64 65 72 00 } //01 00 
		$a_01_6 = {43 3a 5c 54 45 4d 50 5c 5c 7a 2e 69 63 6f 00 } //00 00 
	condition:
		any of ($a_*)
 
}