
rule Trojan_Win32_Ghodow_A{
	meta:
		description = "Trojan:Win32/Ghodow.A,SIGNATURE_TYPE_PEHSTR_EXT,02 00 02 00 03 00 00 "
		
	strings :
		$a_01_0 = {81 7d ec 02 76 19 89 0f 85 } //1
		$a_01_1 = {80 39 8b 75 06 80 79 01 35 74 09 41 42 83 fa 64 7c ee eb 03 } //1
		$a_03_2 = {cd 2a 8d 15 ?? ?? ?? ?? cd ee eb 13 68 f4 01 00 00 } //1
	condition:
		((#a_01_0  & 1)*1+(#a_01_1  & 1)*1+(#a_03_2  & 1)*1) >=2
 
}
rule Trojan_Win32_Ghodow_A_2{
	meta:
		description = "Trojan:Win32/Ghodow.A,SIGNATURE_TYPE_PEHSTR_EXT,08 00 06 00 08 00 00 "
		
	strings :
		$a_01_0 = {75 6e 69 6f 6e 69 64 3d 25 73 26 6d 61 63 3d 25 73 26 69 65 76 65 72 3d 25 64 26 61 6c 65 78 61 3d 25 64 26 73 79 73 74 65 6d 76 65 72 3d 25 64 26 61 6e 74 69 73 6f 66 74 77 61 72 65 3d 25 73 26 70 6c 75 67 69 6e 76 65 72 3d 25 73 00 } //2 湵潩楮㵤猥洦捡┽♳敩敶㵲搥愦敬慸┽♤祳瑳浥敶㵲搥愦瑮獩景睴牡㵥猥瀦畬楧癮牥┽s
		$a_01_1 = {2f 63 6f 75 6e 74 2e 61 73 70 78 3f 69 3d 00 } //2
		$a_01_2 = {25 73 2f 4e 65 77 43 6f 6e 66 69 67 2e 61 73 70 78 3f 6d 3d 00 } //2
		$a_01_3 = {53 4f 46 54 57 41 52 45 5c 43 6c 61 73 73 65 73 5c 43 4c 53 49 44 5c 7b 33 43 45 46 46 36 43 44 2d 36 46 30 38 2d 34 65 34 64 2d 42 43 43 44 2d 46 46 37 34 31 35 32 38 38 43 33 42 7d 00 } //1 体呆䅗䕒䍜慬獳獥䍜卌䑉筜䌳䙅㙆䑃㘭うⴸ攴搴䈭䍃ⵄ䙆㐷㔱㠲䌸䈳}
		$a_01_4 = {53 4f 46 54 57 41 52 45 5c 4d 69 63 72 6f 73 6f 66 74 5c 49 6e 74 65 72 6e 65 74 20 45 78 70 6c 6f 72 65 72 5c 56 65 72 73 69 6f 6e 20 56 65 63 74 6f 72 00 } //1 体呆䅗䕒䵜捩潲潳瑦䥜瑮牥敮⁴硅汰牯牥噜牥楳湯嘠捥潴r
		$a_01_5 = {51 51 53 65 6c 66 25 64 2e 65 78 65 00 } //1
		$a_03_6 = {8b 7d 0c 8b 4d 10 e8 ?? ?? ?? ?? 30 27 83 c7 01 83 e9 01 75 f1 } //1
		$a_01_7 = {b8 de 45 90 87 0b c0 74 2f 0f b6 d8 0f b6 14 1f 0f b6 0c 1e } //1
	condition:
		((#a_01_0  & 1)*2+(#a_01_1  & 1)*2+(#a_01_2  & 1)*2+(#a_01_3  & 1)*1+(#a_01_4  & 1)*1+(#a_01_5  & 1)*1+(#a_03_6  & 1)*1+(#a_01_7  & 1)*1) >=6
 
}