
rule Ransom_Win32_Qikencrypt_C{
	meta:
		description = "Ransom:Win32/Qikencrypt.C,SIGNATURE_TYPE_PEHSTR_EXT,06 00 06 00 08 00 00 01 00 "
		
	strings :
		$a_01_0 = {65 6e 63 66 69 6c 65 73 2e 74 78 74 00 } //01 00 
		$a_01_1 = {66 69 6c 65 73 2e 6c 69 73 74 00 } //01 00 
		$a_01_2 = {65 6e 63 6d 73 67 2e 68 74 6d 6c 00 } //01 00  湥浣杳栮浴l
		$a_01_3 = {77 69 6e 2e 65 78 65 00 } //02 00 
		$a_01_4 = {77 69 6e 73 74 61 72 74 2e 65 78 65 00 } //02 00 
		$a_01_5 = {4c 6f 73 74 45 76 69 6c 00 } //02 00 
		$a_01_6 = {3c 2f 45 6e 63 72 79 70 74 69 6f 6e 4b 65 79 3e 00 } //02 00 
		$a_01_7 = {2f 69 6e 64 65 78 2e 70 68 70 3f 61 63 74 3d 73 26 73 3d 00 } //00 00  椯摮硥瀮灨愿瑣猽猦=
		$a_00_8 = {5d 04 00 00 } //f9 43 
	condition:
		any of ($a_*)
 
}