
rule Trojan_Win32_Qbot_AK_MTB{
	meta:
		description = "Trojan:Win32/Qbot.AK!MTB,SIGNATURE_TYPE_PEHSTR_EXT,06 00 06 00 06 00 00 01 00 "
		
	strings :
		$a_01_0 = {00 47 4c 37 30 00 } //01 00  䜀㝌0
		$a_01_1 = {00 44 65 74 5f 63 68 69 6c 64 72 65 6e 00 } //01 00  䐀瑥损楨摬敲n
		$a_01_2 = {00 44 6e 6f 6d 65 5f 61 63 63 65 73 73 69 62 69 6c 69 74 79 5f 6d 6f 64 75 6c 65 5f 73 68 75 74 64 6f 77 6e 00 } //01 00 
		$a_01_3 = {00 44 61 69 6c 5f 74 65 78 74 5f 76 69 65 77 5f 67 65 74 5f 74 79 70 65 00 } //01 00 
		$a_01_4 = {00 44 61 69 6c 5f 72 65 6e 64 65 72 65 72 5f 63 65 6c 6c 5f 6e 65 77 00 } //01 00  䐀楡彬敲摮牥牥损汥彬敮w
		$a_01_5 = {00 44 61 69 6c 5f 73 74 61 74 75 73 62 61 72 5f 67 65 74 5f 74 79 70 65 00 } //00 00 
	condition:
		any of ($a_*)
 
}