
rule Trojan_Win32_Gamafeshi_A{
	meta:
		description = "Trojan:Win32/Gamafeshi.A,SIGNATURE_TYPE_PEHSTR_EXT,28 00 28 00 04 00 00 "
		
	strings :
		$a_00_0 = {44 47 4d 4e 4f 45 50 00 } //10 䝄乍䕏P
		$a_00_1 = {25 00 73 00 20 00 2d 00 20 00 25 00 73 00 20 00 2d 00 20 00 25 00 32 00 2e 00 32 00 78 00 } //10 %s - %s - %2.2x
		$a_00_2 = {57 00 49 00 4e 00 57 00 4f 00 52 00 44 00 2e 00 45 00 58 00 45 00 00 00 } //10
		$a_01_3 = {04 cd ab 34 12 75 } //10
	condition:
		((#a_00_0  & 1)*10+(#a_00_1  & 1)*10+(#a_00_2  & 1)*10+(#a_01_3  & 1)*10) >=40
 
}