
rule Trojan_Win32_Lazy_AI_MTB{
	meta:
		description = "Trojan:Win32/Lazy.AI!MTB,SIGNATURE_TYPE_PEHSTR_EXT,05 00 05 00 05 00 00 "
		
	strings :
		$a_01_0 = {81 f1 97 2a fb 32 49 f5 c1 c9 03 81 e9 6d 77 a7 64 81 f1 e1 2b 79 0a 33 d9 f5 3b d3 f8 03 e9 } //2
		$a_01_1 = {8d ad 04 00 00 00 33 d3 f5 81 ea 61 52 0d 46 66 3b cb f7 d2 f5 66 3b f1 0f ca 66 81 fb 80 77 81 f2 36 70 3b 24 66 f7 c4 ea 72 e9 } //2
		$a_01_2 = {70 61 69 79 61 6e 6e 6f 69 74 68 61 69 09 73 61 72 61 61 74 68 61 69 } //1
		$a_01_3 = {6d 6f 6d 61 74 68 61 69 09 79 6f 79 61 6b 74 68 61 69 09 72 6f 72 75 61 74 68 61 69 } //1 潭慭桴楡礉祯歡桴楡爉牯慵桴楡
		$a_01_4 = {66 00 6f 00 6e 00 74 00 63 00 72 00 61 00 66 00 74 00 40 00 68 00 6f 00 74 00 6d 00 61 00 69 00 6c 00 2e 00 63 00 6f 00 6d 00 } //1 fontcraft@hotmail.com
	condition:
		((#a_01_0  & 1)*2+(#a_01_1  & 1)*2+(#a_01_2  & 1)*1+(#a_01_3  & 1)*1+(#a_01_4  & 1)*1) >=5
 
}