
rule Trojan_Win32_Tarifarch_AO{
	meta:
		description = "Trojan:Win32/Tarifarch.AO,SIGNATURE_TYPE_PEHSTR_EXT,05 00 05 00 03 00 00 02 00 "
		
	strings :
		$a_01_0 = {47 04 42 04 3e 04 20 00 12 04 4b 04 20 00 20 04 15 04 10 04 1b 04 2c 04 1d 04 2b 04 19 04 20 00 47 04 35 04 3b 04 3e 04 32 04 35 04 3a 04 } //02 00  что Вы РЕАЛЬНЫЙ человек
		$a_11_1 = {8c 2d c6 5c a3 b9 bd 1d 3b 83 e6 74 27 35 3d 07 a7 cb 56 19 be 18 d4 ca 9e 59 53 90 8b 14 0e 01 } //00 0c 
		$a_00_3 = {69 00 64 00 3d 00 00 00 5d 04 00 00 71 77 03 80 5c 1e 00 00 72 77 03 80 00 00 01 00 05 00 08 00 a5 21 50 69 6d 61 2e 41 00 00 01 40 05 82 64 00 04 00 27 0f 00 00 00 01 2e ee 47 0e 00 84 03 11 d0 01 00 00 00 5d 04 00 00 72 77 03 80 5c 33 00 00 76 77 03 80 00 00 01 00 32 00 1d 00 52 61 6e 73 6f 6d 3a 4d 53 49 4c 2f 53 70 72 69 73 65 43 72 79 70 74 } //2e 41 
	condition:
		any of ($a_*)
 
}