
rule Trojan_BAT_Injuke_NZA_MTB{
	meta:
		description = "Trojan:BAT/Injuke.NZA!MTB,SIGNATURE_TYPE_PEHSTR_EXT,03 00 03 00 03 00 00 "
		
	strings :
		$a_03_0 = {07 06 08 06 8e 69 5d 91 7e ?? ?? ?? 04 08 91 61 d2 6f ?? ?? ?? 0a 08 17 58 0c 08 7e ?? ?? ?? 04 8e 69 32 dc } //1
		$a_01_1 = {21 52 00 76 00 67 00 6e 00 77 00 61 00 6c 00 6e 00 64 00 74 00 79 00 70 00 65 00 63 00 69 00 61 } //1 刡瘀最渀眀愀氀渀搀琀礀瀀攀挀椀愀
		$a_01_2 = {39 39 36 62 2d 31 66 30 61 30 36 37 61 61 39 34 37 } //1 996b-1f0a067aa947
	condition:
		((#a_03_0  & 1)*1+(#a_01_1  & 1)*1+(#a_01_2  & 1)*1) >=3
 
}