
rule TrojanDownloader_Win32_Worbe_B{
	meta:
		description = "TrojanDownloader:Win32/Worbe.B,SIGNATURE_TYPE_PEHSTR_EXT,09 00 08 00 07 00 00 02 00 "
		
	strings :
		$a_01_0 = {67 00 65 00 74 00 62 00 6f 00 74 00 2e 00 76 00 62 00 70 00 00 00 } //02 00 
		$a_01_1 = {3f 00 68 00 61 00 73 00 68 00 3d 00 00 00 } //02 00 
		$a_01_2 = {67 65 74 62 6f 74 00 } //02 00 
		$a_01_3 = {6d 6c 6f 63 61 74 69 6f 6e 00 } //02 00  汭捯瑡潩n
		$a_01_4 = {5c 00 6d 00 73 00 64 00 65 00 66 00 65 00 6e 00 64 00 65 00 72 00 2e 00 65 00 78 00 65 00 00 00 } //01 00 
		$a_01_5 = {70 00 69 00 7a 00 64 00 61 00 73 00 68 00 6b 00 61 00 2e 00 63 00 6f 00 6d 00 } //01 00  pizdashka.com
		$a_01_6 = {68 00 75 00 6a 00 61 00 73 00 68 00 6b 00 61 00 2e 00 63 00 6f 00 6d 00 } //00 00  hujashka.com
	condition:
		any of ($a_*)
 
}