
rule TrojanDownloader_BAT_AgentTesla_EXV_MTB{
	meta:
		description = "TrojanDownloader:BAT/AgentTesla.EXV!MTB,SIGNATURE_TYPE_PEHSTR_EXT,07 00 07 00 07 00 00 01 00 "
		
	strings :
		$a_01_0 = {32 00 30 00 2e 00 32 00 33 00 38 00 2e 00 33 00 37 00 2e 00 32 00 34 00 31 00 2f 00 55 00 70 00 64 00 61 00 74 00 65 00 2f 00 } //01 00  20.238.37.241/Update/
		$a_01_1 = {49 00 4d 00 75 00 69 00 52 00 65 00 73 00 6f 00 75 00 72 00 63 00 65 00 49 00 64 00 4c 00 6f 00 6f 00 6b 00 75 00 70 00 4d 00 61 00 70 00 45 00 6e 00 74 00 72 00 79 00 2e 00 64 00 6c 00 6c 00 } //01 00  IMuiResourceIdLookupMapEntry.dll
		$a_01_2 = {53 00 75 00 62 00 63 00 61 00 74 00 65 00 67 00 6f 00 72 00 79 00 4d 00 65 00 6d 00 62 00 65 00 72 00 73 00 68 00 69 00 70 00 45 00 6e 00 74 00 72 00 79 00 46 00 69 00 65 00 6c 00 64 00 49 00 64 00 } //01 00  SubcategoryMembershipEntryFieldId
		$a_01_3 = {57 00 69 00 6e 00 64 00 6f 00 77 00 43 00 6c 00 61 00 73 00 73 00 45 00 6e 00 74 00 72 00 79 00 46 00 69 00 65 00 6c 00 64 00 49 00 64 00 } //01 00  WindowClassEntryFieldId
		$a_01_4 = {00 46 72 6f 6d 42 61 73 65 36 34 53 74 72 69 6e 67 00 } //01 00  䘀潲䉭獡㙥匴牴湩g
		$a_01_5 = {00 44 6f 77 6e 6c 6f 61 64 44 61 74 61 00 } //01 00  䐀睯汮慯䑤瑡a
		$a_01_6 = {00 47 65 74 54 79 70 65 00 } //00 00 
	condition:
		any of ($a_*)
 
}