
rule TrojanDownloader_Win32_Banload_gen_G{
	meta:
		description = "TrojanDownloader:Win32/Banload.gen!G,SIGNATURE_TYPE_PEHSTR_EXT,14 00 0f 00 07 00 00 "
		
	strings :
		$a_02_0 = {63 6f 6e 66 69 67 65 78 2e 64 6c 6c 00 90 05 03 01 00 68 74 74 70 3a 2f 2f [0-30] 2f 63 6f 6e 66 69 67 [0-02] 2e 74 78 74 00 } //10
		$a_01_1 = {47 65 72 61 6c 00 } //4 敇慲l
		$a_01_2 = {61 75 74 6f 6d 73 6e 00 } //1 畡潴獭n
		$a_01_3 = {61 75 74 6f 72 6b 00 } //1
		$a_01_4 = {4d 65 6e 73 61 67 65 6d 48 6f 74 6d 61 69 6c 00 } //1 敍獮条浥潈浴楡l
		$a_01_5 = {41 75 74 65 6e 74 69 63 61 63 61 6f 48 6f 74 6d 61 69 6c 00 } //1 畁整瑮捩捡潡潈浴楡l
		$a_03_6 = {6a 00 6a 00 8d 85 ?? ?? ff ff e8 ?? ?? ?? ?? ff b5 ?? ?? ff ff 68 ?? ?? ?? ?? 68 ?? ?? ?? ?? 8d 85 ?? ?? ff ff ba 03 00 00 00 e8 ?? ?? ?? ?? 8b 85 ?? ?? ff ff e8 ?? ?? ?? ?? 50 68 ?? ?? ?? ?? 6a 00 e8 } //10
	condition:
		((#a_02_0  & 1)*10+(#a_01_1  & 1)*4+(#a_01_2  & 1)*1+(#a_01_3  & 1)*1+(#a_01_4  & 1)*1+(#a_01_5  & 1)*1+(#a_03_6  & 1)*10) >=15
 
}