
rule Trojan_MacOS_Amos_CR_MTB{
	meta:
		description = "Trojan:MacOS/Amos.CR!MTB,SIGNATURE_TYPE_MACHOHSTR_EXT,02 00 02 00 03 00 00 "
		
	strings :
		$a_01_0 = {6e 74 65 72 5f 74 6f 42 38 6e 65 31 38 30 31 30 30 45 52 53 31 5f 00 5f 5f 5a 4e 4b 53 74 33 5f 5f 31 34 66 70 6f 73 49 31 31 5f 5f 6d 62 73 74 61 74 65 5f 74 45 63 76 78 42 38 6e 65 31 38 30 31 30 30 45 76 00 } //1 瑮牥瑟䉯游ㅥ〸〱䔰卒弱开婟䭎瑓弳ㅟ昴潰䥳ㄱ彟扭瑳瑡彥䕴癣䉸游ㅥ〸〱䔰v
		$a_01_1 = {00 00 00 40 5f 5f 5a 4e 53 74 33 5f 5f 31 31 35 62 61 73 69 63 5f 73 74 72 69 6e 67 62 75 66 49 63 4e 53 5f 31 31 63 68 61 72 5f 74 72 61 69 74 73 49 63 45 45 4e 53 5f 39 61 6c 6c 6f 63 61 74 } //1
		$a_01_2 = {48 8b 7d e0 e8 8b 17 00 00 48 83 c4 20 5d c3 48 8b 7d e0 48 89 c1 } //1
	condition:
		((#a_01_0  & 1)*1+(#a_01_1  & 1)*1+(#a_01_2  & 1)*1) >=2
 
}