
rule Trojan_BAT_Zusy_HNH_MTB{
	meta:
		description = "Trojan:BAT/Zusy.HNH!MTB,SIGNATURE_TYPE_PEHSTR_EXT,07 00 07 00 05 00 00 "
		
	strings :
		$a_01_0 = {56 69 72 74 75 61 6c 41 6c 6c 6f 63 45 78 5f 44 65 6c 65 67 61 74 65 00 52 65 61 64 50 72 6f 63 65 73 73 4d 65 6d 6f 72 79 5f 44 65 6c 65 67 61 74 65 00 57 72 69 74 65 50 72 6f 63 65 73 73 4d 65 6d 6f 72 79 5f 44 65 6c 65 67 61 74 65 } //3 楖瑲慵䅬汬捯硅䑟汥来瑡e敒摡牐捯獥䵳浥牯役敄敬慧整圀楲整牐捯獥䵳浥牯役敄敬慧整
		$a_01_1 = {00 45 78 65 63 75 74 65 00 } //1
		$a_01_2 = {00 5a 77 55 6e 6d 61 70 56 69 65 77 4f 66 53 65 63 74 69 6f 6e 00 } //1 娀啷浮灡楖睥晏敓瑣潩n
		$a_01_3 = {00 43 72 65 61 74 65 50 72 6f 63 65 73 73 41 00 } //1 䌀敲瑡健潲散獳A
		$a_01_4 = {00 0b 6e 00 74 00 64 00 6c 00 6c 00 00 } //1
	condition:
		((#a_01_0  & 1)*3+(#a_01_1  & 1)*1+(#a_01_2  & 1)*1+(#a_01_3  & 1)*1+(#a_01_4  & 1)*1) >=7
 
}