
rule Trojan_BAT_IxenMarch_A_dha{
	meta:
		description = "Trojan:BAT/IxenMarch.A!dha,SIGNATURE_TYPE_PEHSTR_EXT,04 00 04 00 04 00 00 "
		
	strings :
		$a_01_0 = {00 47 65 74 57 6f 72 6b 61 62 6c 65 4c 6f 67 69 63 61 6c 44 72 69 76 65 73 50 61 74 68 65 73 00 } //1 䜀瑥潗歲扡敬潌楧慣䑬楲敶偳瑡敨s
		$a_01_1 = {00 46 69 6c 65 4d 61 6e 61 67 65 72 00 } //1
		$a_01_2 = {00 50 61 72 73 65 50 61 74 68 44 69 72 65 63 74 6f 72 69 65 73 00 } //1 倀牡敳慐桴楄敲瑣牯敩s
		$a_01_3 = {00 50 72 6f 63 65 73 73 65 73 46 69 6c 65 73 00 } //1 倀潲散獳獥楆敬s
	condition:
		((#a_01_0  & 1)*1+(#a_01_1  & 1)*1+(#a_01_2  & 1)*1+(#a_01_3  & 1)*1) >=4
 
}