
rule Trojan_Win32_Hinigto_A{
	meta:
		description = "Trojan:Win32/Hinigto.A,SIGNATURE_TYPE_PEHSTR_EXT,05 00 05 00 06 00 00 01 00 "
		
	strings :
		$a_01_0 = {5c 49 6e 74 65 72 6e 65 74 20 45 78 70 6c 6f 72 65 72 5c 49 45 58 50 4c 4f 52 45 2e 45 58 45 00 } //01 00  䥜瑮牥敮⁴硅汰牯牥䥜塅䱐剏⹅塅E
		$a_00_1 = {5c 43 6f 6d 6d 6f 6e 20 46 69 6c 65 73 5c 53 65 72 76 69 63 65 73 5c 73 76 63 68 6f 73 74 2e 65 78 65 00 } //01 00 
		$a_01_2 = {25 44 6f 77 6e 55 52 4c 25 00 } //01 00  䐥睯啮䱒%
		$a_01_3 = {25 45 78 65 46 69 6c 65 25 00 } //01 00  䔥數楆敬%
		$a_01_4 = {00 63 6d 64 20 2f 63 20 65 72 61 73 65 20 2f 46 20 22 00 } //01 00 
		$a_02_5 = {5a 58 85 ff 75 0c 85 d2 74 03 ff 4a f8 e8 90 01 02 ff ff 5a 5f 5e 5b 58 8d 24 94 ff e0 90 00 } //00 00 
	condition:
		any of ($a_*)
 
}