
rule Worm_Win32_Bokill_D{
	meta:
		description = "Worm:Win32/Bokill.D,SIGNATURE_TYPE_PEHSTR_EXT,04 00 03 00 06 00 00 01 00 "
		
	strings :
		$a_01_0 = {50 72 6f 61 63 74 69 76 65 42 6f 74 6b 69 6c 6c 00 } //01 00 
		$a_01_1 = {6d 6f 64 75 73 62 73 70 72 65 61 64 00 } //01 00 
		$a_01_2 = {6d 6f 64 42 6f 74 6b 69 6c 6c 00 } //01 00 
		$a_01_3 = {6d 6f 64 61 76 6b 69 6c 6c 00 } //01 00  潭慤歶汩l
		$a_01_4 = {54 77 69 74 74 65 72 53 70 72 65 61 64 65 72 00 } //01 00  睔瑩整卲牰慥敤r
		$a_01_5 = {53 65 6e 64 6d 65 73 73 61 67 65 53 70 72 65 61 64 46 61 63 65 62 6f 6f 6b 00 } //00 00  敓摮敭獳条卥牰慥䙤捡扥潯k
	condition:
		any of ($a_*)
 
}