
rule Backdoor_Win32_Wollf_gen_A{
	meta:
		description = "Backdoor:Win32/Wollf.gen!A,SIGNATURE_TYPE_PEHSTR_EXT,06 00 05 00 07 00 00 01 00 "
		
	strings :
		$a_00_0 = {50 4f 50 4d 53 47 20 3c 4d 65 73 73 61 67 65 3e 00 } //01 00 
		$a_00_1 = {4b 49 4c 4c 20 3c 50 72 6f 63 65 73 73 5f 49 44 3e 00 } //01 00  䥋䱌㰠牐捯獥彳䑉>
		$a_00_2 = {46 50 55 54 20 3c 4c 6f 63 61 6c 5f 66 69 6c 65 3b 52 65 6d 6f 74 65 5f 66 69 6c 65 5b 3b 55 73 65 72 3b 50 61 73 73 5d 3e 00 } //01 00  偆呕㰠潌慣彬楦敬刻浥瑯彥楦敬㭛獕牥倻獡嵳>
		$a_00_3 = {53 59 53 49 4e 46 4f 00 } //01 00  奓䥓䙎O
		$a_00_4 = {66 70 75 74 00 00 00 00 66 67 65 74 00 00 00 00 77 67 65 74 00 00 00 00 } //03 00 
		$a_01_5 = {56 8b 74 24 08 85 f6 7f 04 33 c0 5e c3 8b 54 24 0c 57 8b fa 83 c9 ff 33 c0 6a 00 f2 ae f7 d1 49 51 52 56 } //05 00 
		$a_03_6 = {be be 1d 00 00 53 90 03 04 04 6a 90 01 01 68 90 01 04 8d 44 24 90 01 01 56 50 e8 90 01 04 90 03 02 02 8b e8 89 c5 83 c4 10 90 03 02 02 3b eb 39 dd 7f 90 00 } //00 00 
	condition:
		any of ($a_*)
 
}