
rule Trojan_Win32_Rozena_HNC_MTB{
	meta:
		description = "Trojan:Win32/Rozena.HNC!MTB,SIGNATURE_TYPE_PEHSTR_EXT,04 00 04 00 04 00 00 01 00 "
		
	strings :
		$a_01_0 = {00 43 6f 70 79 00 52 65 61 64 50 72 6f 63 65 73 73 4d 65 6d 6f 72 79 00 57 72 69 74 65 50 72 6f 63 65 73 73 4d 65 6d 6f 72 79 00 6f 70 5f 45 71 75 61 6c 69 74 79 00 } //01 00 
		$a_01_1 = {43 72 65 61 74 65 50 72 6f 63 65 73 73 00 } //01 00  牃慥整牐捯獥s
		$a_01_2 = {00 5a 77 51 75 65 72 79 49 6e 66 6f 72 6d 61 74 69 6f 6e 50 72 6f 63 65 73 73 } //01 00  娀具敵祲湉潦浲瑡潩偮潲散獳
		$a_01_3 = {00 52 65 73 75 6d 65 54 68 72 65 61 64 00 } //00 00  刀獥浵呥牨慥d
	condition:
		any of ($a_*)
 
}