
rule Trojan_Win32_Vundo_AY{
	meta:
		description = "Trojan:Win32/Vundo.AY,SIGNATURE_TYPE_PEHSTR,01 00 01 00 01 00 00 01 00 "
		
	strings :
		$a_01_0 = {2e 44 4c 4c 00 44 6c 6c 43 61 6e 55 6e 6c 6f 61 64 4e 6f 77 00 44 6c 6c 47 65 74 43 6c 61 73 73 4f 62 6a 65 63 74 00 49 6e 69 74 53 65 63 75 72 69 74 79 49 6e 74 65 72 66 61 63 65 57 00 4c 73 61 41 70 43 61 6c 6c 50 61 63 6b 61 67 65 00 4c 73 61 41 70 43 61 6c 6c 50 61 63 6b 61 67 65 50 61 73 73 74 68 72 6f 75 67 68 00 4c 73 61 41 70 43 61 6c 6c 50 61 63 6b 61 67 65 55 6e 74 72 75 73 74 65 64 00 4c 73 61 41 70 49 6e 69 74 69 61 6c 69 7a 65 50 61 63 6b 61 67 65 00 4c 73 61 41 70 4c 6f 67 6f 6e 54 65 72 6d 69 6e 61 74 65 64 00 4c 73 61 41 70 4c 6f 67 6f 6e 55 73 65 72 00 4c 73 61 41 70 4c 6f 67 6f 6e 55 73 65 72 45 78 00 53 70 49 6e 69 74 69 61 6c 69 7a 65 00 63 00 66 00 6f 00 73 00 } //00 00  䐮䱌䐀汬慃啮汮慯乤睯䐀汬敇䍴慬獳扏敪瑣䤀楮却捥牵瑩䥹瑮牥慦散W獌䅡䍰污偬捡慫敧䰀慳灁慃汬慐正条健獡瑳牨畯桧䰀慳灁慃汬慐正条啥瑮畲瑳摥䰀慳灁湉瑩慩楬敺慐正条e獌䅡䱰杯湯敔浲湩瑡摥䰀慳灁潌潧啮敳r獌䅡䱰杯湯獕牥硅匀䥰楮楴污穩ecfos
	condition:
		any of ($a_*)
 
}