
rule Trojan_Win64_Misfox_A_dha{
	meta:
		description = "Trojan:Win64/Misfox.A!dha,SIGNATURE_TYPE_PEHSTR_EXT,06 00 04 00 05 00 00 01 00 "
		
	strings :
		$a_01_0 = {47 6c 6f 62 61 6c 5c 6d 73 69 66 66 30 78 31 00 } //01 00  汇扯污浜楳晦砰1
		$a_01_1 = {2f 6c 64 2e 73 6f 00 } //01 00 
		$a_01_2 = {33 30 66 35 38 37 37 62 64 61 39 31 30 66 32 37 38 34 30 66 32 65 32 31 34 36 31 37 32 33 66 31 00 } //01 00 
		$a_01_3 = {64 6c 6c 36 34 2e 64 6c 6c 00 } //03 00  汤㙬⸴汤l
		$a_01_4 = {48 63 c3 c6 44 04 38 2e ff c3 48 63 c3 c6 44 04 38 72 ff c3 48 63 c3 c6 44 04 38 75 8d 43 01 48 63 c8 48 83 f9 10 73 33 c6 44 0c 38 00 80 7c 24 38 00 74 12 48 8d 44 24 38 48 83 ce ff 48 ff c6 } //00 00 
	condition:
		any of ($a_*)
 
}