
rule Backdoor_Win32_Scrimp_gen_A{
	meta:
		description = "Backdoor:Win32/Scrimp.gen!A,SIGNATURE_TYPE_PEHSTR_EXT,3d 00 3d 00 0a 00 00 0a 00 "
		
	strings :
		$a_01_0 = {6d 6f 6e 6b 65 79 2e 64 61 74 00 61 66 78 6d 73 69 6e 63 69 65 6e 00 } //0a 00 
		$a_01_1 = {6d 6f 6e 6b 65 79 2e 64 61 74 00 61 66 78 6d 66 6c 78 63 75 00 } //0a 00 
		$a_01_2 = {6d 6f 6e 6b 65 79 2e 64 61 74 00 6a 61 70 63 70 65 65 72 00 } //32 00  潭歮祥搮瑡樀灡灣敥r
		$a_01_3 = {5c 6d 73 65 78 74 6c 6f 67 2e 64 6c 6c 00 00 00 6d 73 6c 6f 67 00 00 00 4d 69 63 6f 53 6f 66 74 } //32 00 
		$a_01_4 = {20 3e 20 00 4d 69 63 6f 53 6f 66 74 45 } //01 00 
		$a_01_5 = {77 73 63 73 63 6f 6e 2e 64 6c 6c 00 31 32 } //01 00 
		$a_01_6 = {6d 6f 6e 6b 65 79 2e 64 6c 6c 00 26 31 32 } //01 00  潭歮祥搮汬☀㈱
		$a_01_7 = {68 73 63 61 6e 63 6f 6e 2e 64 6c 6c 00 32 } //01 00  獨慣据湯搮汬㈀
		$a_01_8 = {77 6d 70 6c 63 73 2e 64 6c 6c 00 26 31 32 } //01 00  海汰獣搮汬☀㈱
		$a_01_9 = {6d 73 76 6d 72 65 67 33 32 2e 64 6c 6c 00 } //00 00  獭浶敲㍧⸲汤l
	condition:
		any of ($a_*)
 
}