
rule Trojan_BAT_CobaltWebshell_AC_MTB{
	meta:
		description = "Trojan:BAT/CobaltWebshell.AC!MTB,SIGNATURE_TYPE_PEHSTR_EXT,15 00 15 00 07 00 00 03 00 "
		
	strings :
		$a_01_0 = {44 65 62 75 67 67 65 72 4e 6f 6e 55 73 65 72 43 6f 64 65 41 74 74 72 69 62 75 74 65 00 54 65 6d 70 6c 61 74 65 43 6f 6e 74 72 6f 6c 00 73 65 74 5f 41 70 70 52 65 6c 61 74 69 76 65 56 69 72 74 75 61 6c 50 61 74 68 } //03 00 
		$a_01_1 = {52 65 61 64 53 74 72 69 6e 67 52 65 73 6f 75 72 63 65 00 53 74 72 69 6e 67 00 47 65 74 57 72 61 70 70 65 64 46 69 6c 65 44 65 70 65 6e 64 65 6e 63 69 65 73 00 43 6f 6e 74 72 6f 6c } //03 00  敒摡瑓楲杮敒潳牵散匀牴湩g敇坴慲灰摥楆敬敄数摮湥楣獥䌀湯牴汯
		$a_01_2 = {49 52 65 71 75 69 72 65 73 53 65 73 73 69 6f 6e 53 74 61 74 65 00 49 48 74 74 70 48 61 6e 64 6c 65 72 } //03 00  剉煥極敲即獥楳湯瑓瑡e䡉瑴䡰湡汤牥
		$a_80_3 = {41 70 70 5f 57 65 62 5f } //App_Web_  03 00 
		$a_80_4 = {69 69 73 6d 65 74 61 } //iismeta  03 00 
		$a_80_5 = {2e 61 73 70 78 } //.aspx  03 00 
		$a_80_6 = {41 64 64 57 72 61 70 70 65 64 46 69 6c 65 44 65 70 65 6e 64 65 6e 63 69 65 73 } //AddWrappedFileDependencies  00 00 
	condition:
		any of ($a_*)
 
}