
rule Trojan_BAT_ShellCodeRunner_GPSB_MTB{
	meta:
		description = "Trojan:BAT/ShellCodeRunner.GPSB!MTB,SIGNATURE_TYPE_PEHSTR_EXT,08 00 08 00 02 00 00 "
		
	strings :
		$a_01_0 = {11 0d 11 0e 11 0f 11 0a 5a 11 10 58 11 0b 61 d2 9c 11 0e 17 58 13 0e 11 0e 11 0c } //7
		$a_01_1 = {67 65 74 5f 49 73 56 61 6c 75 65 54 79 70 65 00 41 63 74 69 76 61 74 6f 72 00 43 72 65 61 74 65 49 6e 73 74 61 6e 63 65 00 67 65 74 5f 49 73 41 72 72 61 79 00 41 72 72 61 79 00 49 6e 76 6f 6b 65 00 53 79 73 74 65 6d 2e 54 68 72 65 61 64 69 6e 67 2e 54 61 73 6b 73 00 54 61 73 6b 00 54 61 73 6b 41 77 61 69 74 65 72 00 47 65 74 41 77 61 69 74 65 72 00 47 65 74 52 65 73 75 6c 74 } //1 敧彴獉慖畬呥灹e捁楴慶潴r牃慥整湉瑳湡散最瑥䥟䅳牲祡䄀牲祡䤀癮歯e祓瑳浥吮牨慥楤杮吮獡獫吀獡k慔歳睁楡整r敇䅴慷瑩牥䜀瑥敒畳瑬
	condition:
		((#a_01_0  & 1)*7+(#a_01_1  & 1)*1) >=8
 
}