
rule PWS_Win32_Frethog_AI{
	meta:
		description = "PWS:Win32/Frethog.AI,SIGNATURE_TYPE_PEHSTR_EXT,06 00 06 00 06 00 00 "
		
	strings :
		$a_01_0 = {26 69 6e 74 72 6f 3d 00 26 75 72 6c 3d 00 } //1 椦瑮潲=甦汲=
		$a_01_1 = {00 4e 75 6d 00 45 6e 74 65 72 } //1 一浵䔀瑮牥
		$a_01_2 = {25 73 0a 00 64 61 74 61 5c } //1
		$a_01_3 = {3b c2 7e 79 81 c1 1e 02 00 00 3b c1 7d 6f 8d 45 fc 50 56 } //2
		$a_01_4 = {6a 04 50 68 b4 5e f7 01 57 ff d6 } //3
		$a_01_5 = {6a 04 50 68 94 56 f7 01 57 ff d6 8d 45 10 50 6a 14 68 } //3
	condition:
		((#a_01_0  & 1)*1+(#a_01_1  & 1)*1+(#a_01_2  & 1)*1+(#a_01_3  & 1)*2+(#a_01_4  & 1)*3+(#a_01_5  & 1)*3) >=6
 
}