
rule Trojan_Win32_Fragtor_ASFA_MTB{
	meta:
		description = "Trojan:Win32/Fragtor.ASFA!MTB,SIGNATURE_TYPE_PEHSTR_EXT,05 00 05 00 02 00 00 05 00 "
		
	strings :
		$a_01_0 = {c7 00 53 6f 66 74 c7 40 04 77 61 72 65 c7 40 08 5c 4d 69 63 c7 40 0c 72 6f 73 6f c7 40 10 66 74 5c 57 c7 40 14 69 6e 64 6f c7 40 18 77 73 5c 43 } //05 00 
		$a_01_1 = {41 75 74 6f 52 75 6e 00 43 50 55 5f 49 64 65 6e 74 69 66 69 63 61 74 69 6f 6e 00 44 4c 4c 5f 49 6e 6a 65 63 74 69 6f 6e 00 44 65 62 75 67 67 65 72 5f 49 64 65 6e 74 69 66 69 63 61 74 69 6f 6e 00 44 65 63 6f 64 65 5f 42 61 73 65 36 34 00 44 65 6c 65 74 65 5f 46 69 6c 65 00 44 65 6c 65 74 65 5f 49 74 73 65 6c 66 00 4c 6f 61 64 5f 46 72 6f 6d 5f 46 69 6c 65 00 52 75 6e 5f 46 72 6f 6d 5f 4d 65 6d 6f 72 79 00 53 74 72 69 6e 67 5f 58 4f 52 } //00 00  畁潴畒n偃录摉湥楴楦慣楴湯䐀䱌䥟橮捥楴湯䐀扥杵敧彲摉湥楴楦慣楴湯䐀捥摯彥慂敳㐶䐀汥瑥彥楆敬䐀汥瑥彥瑉敳晬䰀慯彤牆浯䙟汩e畒彮牆浯䵟浥牯y瑓楲杮塟剏
	condition:
		any of ($a_*)
 
}