
rule Trojan_Win32_Fragtor_AMMC_MTB{
	meta:
		description = "Trojan:Win32/Fragtor.AMMC!MTB,SIGNATURE_TYPE_PEHSTR_EXT,02 00 02 00 02 00 00 "
		
	strings :
		$a_03_0 = {8b 55 f4 8b 45 ec 8d 34 02 8b 55 f4 8b 45 08 01 d0 0f b6 00 88 45 e7 8b 5d f4 8b 45 0c 89 04 24 e8 ?? ?? ?? ?? 89 c1 89 d8 ba ?? ?? ?? ?? f7 f1 8b 45 0c 01 d0 0f b6 00 32 45 e7 88 06 83 45 f4 01 8b 45 f4 3b 45 f0 7c } //2
		$a_01_1 = {5f 44 65 62 75 67 67 65 72 5f 49 64 65 6e 74 69 66 69 63 61 74 69 6f 6e 00 5f 43 50 55 5f 49 64 65 6e 74 69 66 69 63 61 74 69 6f 6e 00 5f 53 74 72 69 6e 67 5f 58 4f 52 00 5f 44 4c 4c 5f 49 6e 6a 65 63 74 69 6f 6e 00 5f 4c 6f 61 64 5f 46 72 6f 6d 5f 46 69 6c 65 00 5f 44 65 63 6f 64 65 5f 42 61 73 65 36 34 00 5f 52 75 6e 5f 46 72 6f 6d 5f 4d 65 6d 6f 72 79 00 5f 44 65 6c 65 74 65 5f 46 69 6c 65 } //2 䑟扥杵敧彲摉湥楴楦慣楴湯开偃录摉湥楴楦慣楴湯开瑓楲杮塟剏开䱄彌湉敪瑣潩n䱟慯彤牆浯䙟汩e䑟捥摯彥慂敳㐶开畒彮牆浯䵟浥牯y䑟汥瑥彥楆敬
	condition:
		((#a_03_0  & 1)*2+(#a_01_1  & 1)*2) >=2
 
}